Tekla.Structures.Model.ConnectiveGeometryException
The ConnectiveGeometryException class represents an error that occurred during the ConnectiveGeometry creation or modification.

Tekla.Structures.Model.ConnectiveGeometryException.OperationStatus
Possible error statuses for geometry creation/modification commands.

Tekla.Structures.Model.ConnectiveGeometryException.#ctor
Initializes a new instance of the ConnectiveGeometryException class with general connective geometry error message.

Tekla.Structures.Model.ConnectiveGeometryException.#ctor(Tekla.Structures.Model.BentPlateGeometrySolver.OperationStatus,System.String)
Initializes a new instance of the ConnectiveGeometryException class with connective geometry error message based on status.
status: Possible error statuses for geometry creation/modification commands.
errorMessage: The message that describes the error status.